Repository: trapwalker/geocmp
Catalog: locales/*/LC_MESSAGES/geocmp.po
Languages: ru_ru

source: Geocmp utility for compare GIS-files on the map
ru_ru: Утилита Geocmp для сравнения GIS-файлов на карте

source: A utility for creating an interactive HTML map that allows rapid switching between multiple GeoJSON files for visual comparison. The tool generates a single HTML file with a layer control panel to toggle between datasets.
ru_ru: Утилита для создания интерактивной HTML-карты, позволяющей быстро переключаться между несколькими GeoJSON-файлами для визуального сравнения. Инструмент генерирует единый HTML-файл с панелью управления слоями для переключения между наборами данных.

source: Glob pattern(s) or GeoJSON file(s) (e.g., 'data/*.geojson' or file1.geojson file2.geojson)
ru_ru: Шаблон(ы) Glob или файл(ы) GeoJSON (например, 'data/*.geojson' или file1.geojson file2.geojson)

source: Output file path (default: STDOUT)
ru_ru: Путь к выходному файлу (по умолчанию: STDOUT)

source: Enable verbose logging
ru_ru: Включить подробное логирование

source: Title of output file
ru_ru: Заголовок выходного файла

source: Open in browser
ru_ru: Открыть в браузере

source: Path to extra CSS
ru_ru: Путь к дополнительному CSS

source: Path to extra JS code
ru_ru: Путь к дополнительному JS-коду

source: Received GeoJSON paths in arguments (%d):%s%s
ru_ru: Получены пути к GeoJSON в параметрах (%d):%s%s

source: Documents to compare (%d):%s%s
ru_ru: Документы к сравнению (%d):%s%s

source: Saving result to file: %s
ru_ru: Сохранение результата в файл: %s

source: Saving to temporary file: %s
ru_ru: Сохранение во временный файл: %s

source: Output to stdout
ru_ru: Вывод в stdout

source: Opening in browser: %s
ru_ru: Открытие в браузере: %s

source: Operation interrupted by user (Ctrl-C)
ru_ru: Операция прервана пользователем (Ctrl-C)

source: Fatal error: %s
ru_ru: Критическая ошибка: %s

source: Cannot read %s: %s
ru_ru: Не удаётся прочитать %s: %s

source: Invalid file format %s: %s
ru_ru: Некорректный формат файла %s: %s

source: Invalid GeoJSON format: %s
ru_ru: Некорректный формат GeoJSON: %s

source: Cannot process style parameter %s=%r: %s
ru_ru: Не удаётся обработать параметр стиля %s=%r: %s

source: Remove all temporary files created by geocmp
ru_ru: Удалить все временные файлы, созданные geocmp

source: Show what would be deleted without deleting
ru_ru: Показать, что будет удалено, без фактического удаления

source: No temporary files found
ru_ru: Временные файлы не найдены

source: Found %d temporary file(s):
ru_ru: Найдено временных файлов: %d

source: Dry run mode - no files deleted
ru_ru: Режим пробного запуска - файлы не удалены

source: Deleted: %s
ru_ru: Удалено: %s

source: Failed to delete %s: %s
ru_ru: Не удалось удалить %s: %s

source: Deleted %d file(s), freed %s bytes
ru_ru: Удалено файлов: %d, освобождено байт: %s

source: Error during cleanup: %s
ru_ru: Ошибка при очистке: %s
